---
layout: page
title:  Лабораторная работа 2
published: true
description: Задание для лабораторной работы 2.
---

## Задание 2.1 (для двух подгрупп)

Координаты 'живых' клеток колонии заданы списком пар координат $$x$$ и $$y$$:
~~~python
cells = [ [1, 1], [2, 1], [3, 1], [3, 2], [2, 3] ]
~~~
Напишите программу, которая для заданных координат определяет занята клетка или свободна.

Первый вариант программы

~~~python
cells = [ [1, 1], [2, 1], [3, 1], [3, 2], [2, 3] ]

x = 1
y = 3

isOccuped = False

for cell in cells :
    if x == cell[0] and y == cell[1] :
      isOccuped = True
      break

print(isOccuped)
~~~

Второй вариант программы

~~~python
cells = [ [1, 1], [2, 1], [3, 1], [3, 2], [2, 3] ]

x = 1
y = 3

isOccuped = [x, y] in cells      

print(isOccuped)
~~~


## Задание 2.2 (для двух подгрупп)

Координаты 'живых' клеток колонии заданы списком пар координат $$x$$ и $$y$$:
~~~python
cells = [ [1,1], [2,1], [3,1], [3,2], [2,3] ]
~~~
Напишите программу, которая для заданных координат клетки поля определяет количество её соседей:
~~~python
x = 1
y = 1
#
# Текст программы
#
print(neighbors)
~~~
